#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-AWeQ64tbMVgphQBH

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-35f3a1ad-d794-4ac3-92cc-989e34064519]
aws_instance.composer_external: Refreshing state... [id=i-0ac77e3d9390f2d74]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_internal: Refreshing state... [id=i-0bb67d22477f527df]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-7bbb285d-e996-40ac-a242-794b5cd6792f]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-3904188661]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-850308169]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 5 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 5 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs9wV5QFLEsLnFfTwt9EJKim+eojcbvbNRTTfBYexKokVJv1qiBcaNyJMVKMF9Mcv4wUz3xpG/ozzOkT3BVPBUY5ZkUCKVzh/GlTcBgWjBOeWpL00BCF1kOr1bpQPfk53p16Ve5BtTEmF/mmLZsdYzC1BhP9RWvr7d6lzLX17j+urNj4BcqjrOzquQsLh9IkgTTg4plH0tZVv2dainaCS29rysvUUNTB/LlgcBXRFYf3DOcUEm6X5vGl/74BrjswnmuYodoFXO6K9lW60jEUy3w7mKJ3p5OBbr3Yxvg5ZCwrnmq19yervp2sChN4TOnlEmu3fcf3VH6zUGVpQr7fjvw5TtfRf1w+ICHpDgcvQZrAiBbgGfwZ3DEMk1uXufs3cBdu/Gp5jR/Xz9h8uwWuGhAEz+Du+1YjyKGcVTNc9lkX684C/277/ml2fEA6SWnEcvR9KH8EWrkNzrPbJoelz4FlmoNBAlcYyKUanIOIgrZrVt+4uikqnsDVB5KTjtM9n37VghRtyjn0JO68Vg1ZQipvAjohRjHAW5wfgMSDAqOUBgWANAAkXQGWguJQkHR1VVlgBgKIk5QCib9ZK4nPlF9lt0vIAUQIFwXYRrCcOQHbUIrJSTDGgIUYJNeTFynBt3rKYwUgS3MGxEdBLI267JZ/mwIDGAR5KZykCJIwLdjNPjxrD5KIPp1UfDXMwXm0PAAWQgZ2+KccA5oygCGL6KrkO5uFkzQ/gJSeviJaMEjRm32dvtIZXeIe3JeB/6Y6Wl55N0V5dz+Dh8a/3hhW3moDoAMiuLhZZiGmAO8xArVNkddOR6r5Ea1l6THN/ZS9QILzm1MotNjkZwjzNGWnp4biUDCcgKigPzGw3BDy3l51MFYuNp9Ypm2rD2q3lhcZRPjN8Ef+W8NZlLyzexexMKJA+Gcc6eyNF9+IlmCHAYIU5BiiEKCAVr/OU19jQJ9Yyu+SEB4CTH//BFwMdhEhAJIdPBRghRmAoM5LIMQ5Bj5GsPScdAkQiTBlAOGcFe9hKq8T5CEmLyigwB1YfXApbh+MuEVuCSOCbx00i+jqHwDjV0WWsVCvS7dLecpSlJJzErjZKBhkmzLP1Xnpw3WBoiAgPdW1AnwGnXY50A3UQadtKaWLXDJWHhZJDcHa+bzcBmdlYgNf/qFDveXCv3r4b5Pjv5xIfViEb5duYhqAE09R+stVTPV9Pv2pAJhuozylZRYEW5hH0Ce4ADDH4JoccXByjac31r87nf6o6M7AmOiaoltXZ57Ziq28q9CvG7zBH8rxbdtRi8pUz/nnVM9dj8RduoiLXE0xzXZPeb77n//6z/8G99pEH1gv5YBtneLzsmAqhjPoKGX2uqycfBqy62e3bSnX9w9DMe2x9Xz/O7grQPFagALTgEtwccoCHHcynNvkBNy/nQpwVwLOT4MDuLu/GHb3+4tUjMIU3J9lVyr5hqIkOD97oDBJA/Bp/zf4zJmUf+D5j0WUA+dchxgBmJa3CjiOprtzOfmVp9q/59F1zxUhJuTcBf7Sq+uNd5ZVi8ObFGRRhsvorRTpJkf4+288lR9BD7N35QUMutXKQDettt5RXgbd5/vfoRJ4blyc3PKpVhOararYqFcv/9YIZLhgtQQzyAWQwdpVFhcFvy91tIsCJyU+ZYGkMMHVimqPx2/d6vPd/efvN7BfuPvPN8Z8uSvFTfOIMpBuzoZTvLuRe7rzOxOzUyW9FKPrdhmn95/fqf5SPYk0Lyh8YKhWrr/KSy4w495E3b8T89u47Qs456HCLwF6u3WWAqOvn8Ew8CoqGM7f+8UpbZc0lQ9Bc4rZd71/WfK48xK3hWSDwb+X8cJhGmRpRNk5kj//2lTx5cJykRIFJf1fmbG+gL+A9SvgcnBXNU98JssjuroDP58BuR2nXi62vlzGqeq6SGnlyv5rlHd/ozDwF3C6pDwB3PJvNaDyvZHv8v85gOPghqW/JV/r4oykB1DOy6ficB5tirOfXTZLL7uOL6DTPrVD0TJCkOFqxYcFbtYBFwAO/PGPfwT3nz+8An8BP4P7z7eT7JebGeiX1MT4cJow3un6//Lr77xN/FVXPgN5eoh477lfN+6+T3l2yzdQv0XvzMDF+HBC8INglLP/o+Dr1dzExTen+e25+Kk5KKvDdxy9rC6b7Iak8iOwJt3J+5mBYhyUeRildIvzsh5Fp86yq5ugLLE52JW97g4DAjcUhdUKguwUFHc3SF/GhC+36JdV6ssd+PnnWxN+QxBfy/kmu+AKCpxvI4Qv+E5znJX99MfHkJ8KkOMkZfgj2yn2ixTFuBy8fqGNu0o7i7i8nP3pI6xPjw88/w2YHPdD5X8DAAD//7q77132HwAA" -> "H4sIAAAAAAAA/9RZ2XLjuHq+d9W8A+JxamaqQ4mLJFs+46kjSqRWUhK4iTpJuUAQEimCi0lo7ekXyU1u83h5hBS1uGV3z5pTlRrftAj8G358/4ZupwkjCePMfUYeQbymLMxQzqpxuCP+34CXrhMf5funW62vKfLY0jst6N7elF+cTfIiTJNHIFT4b26+ueG4a6Jvbi6yO2GRpUXIjrSIMYSDmCTsb2ARUpKgmDzdhknIKnixvP3MZeYoKRYk55QEp36YLB/BvReyK4KjyYzsWBXTdO1zOE0W4fKbGy2MyRfGfXtNc3OzLkhePN4AwIHSgkdAsMiVizcAAFAUwTNasyDNwwPxnyOyP9KWfxy4LYqAywsEWq1WS5b0A2oLeywq5WenNW3JrVar3Zq2d6uF2u/T7qKdNENMe/vYyRU5Ny2RjhosMrqmQLJ7vz05bIWV23CSYEonMy0jkzzUd/qMdh+wM25WoZrJPn9oqlt9/yFaLIPmYr3X3Vqz/0FDjfHetOVlPdBTdbeAs2497DFcNaY08RQ1HGZGVKNhltamcyazeNl6WUZGq9E5BPul11jXtWa4M/u7miOv1obGd2fTg77KyGIfOusPRR9+CEQrn0bDlrxe992pl6/oBzWwYzTa5Ju9ORbXxZhtEldeBd5kux/fi85khbKhX20GJnqZKMJW3TcsVUxmuDZZbvllOPUaReip5uFeN8nOkerT5sNLNh07mjvE2XKeUwP1esO5oQXsML7X/Hk+HqnWLDWEFmnta8uAYT0fyyb16sZmci8dDvyLDFURt8e1Mb/N6tvtyyTYbMWEeVJmjibMJ2zwwa7z00mSJbO9YSTzTDyoW0xEwZvtGvdJ0KRJMMrnyxW5x+k0mbTUXRVTqaEYg/0yXE+wvP0QCQ/umrrazHpBMou2g1EEV51sZc5EUtcGQiPt3BeDHq5VnXq0X4w2vlbYgf8itGe9rm2Ps0O69Phm3XZDHs7ULJnDqkDsZbsKPzj2nrkL94HPF/YY+61U7M4XyaB+cKE1Gwya2jxCyW4nKffWOIyUgd4srJXI84dGe7/n+4v+i+kNBLm+uF/4EsIwH9U62LV8tV8V5L3uNFRhdY/nYas7Hgx17zBTeVNii4cdT4Tp0xOI0SrN/54TP0CsgtP49i3eiS/W60LziPn2CfN03ukLuqnUy7X+RBZWKq1lDdWUw13PbGzHUWP2kKyq83uSTvSpUtX47bD2UB+C1Fv7KHyj7Gabh4w8lxnhHJYZYsEjqLI4O4X3c5kjnjcoL46W4VMWeAQ/nw0dG7LVH3We22NN65tPDxJGiweeJ3WxLta8mlBb3C/q3qKOCO9LuCmI+KEpNMUzd3usTcaGAi/s94s6kRq+36w9CHV+gXDN46WG1MANX2p63n2DiORB8Bfvlbee2wo0n0YGz0aG0IaWPzBDuQPtgWVY88GUVy143ONZOxIGhgUVW9E7U2c+m/OqZFgDec5T2+roU010D7otd62oLnjinCexVjc7kQi7geWJUPZ5CB0rG3lCNkC9+cqMVAit7XBKVdnn5y/QtvVpRHtTU7WhpUo+vws1vp7NVb/AQtbRZ/OV5+iS0Q1WZiS8TGf+xFbshmnDObEExTb1GerqY3OWyf42K/dqb/YidWbaA+jzduJY0LFsVYGKyvuxtjdWamBLQW52+Tqxs8aU12WLpxJU1bkRsY0T0dSP9XH7aPOgbVmqMhd91VJU5UjrNDvl9zRS9Wki546tuoata+4hGDlOpls2TUgiw7Gly5owGGmx34cdeefO1IO/Wg5de7CyI03UqVafR8EOWtYOWTvbUR4krTOAZGUfkJilmpTtzB7tWatAsqi7GYn6QHP6O7ySbWJnpsvvkCZgybaz/XSb8noHxq6UHswZrXmq3rAFe24JcjKN6Ah1fXncUxmmmaE5zdh14J70bMNss4MXzRXDYTVNwrl7UIdz215rsV5oqp+1qc07nUEPCvMOpL5uiupmHsHcUe0OTOyR0fOHluN3zR48GIqOHEePfeo7hpohParVfN7falRFjtmvu4dA8Gbyi2a3hpYyLxxFq827KjIVIXBUGkJT1o0ZdDRF7xuJLEGebt2Erj2bWl6bHWBii14HbuyusCe9dENmQQMrULQjYYIjdeBNs5onFhKmNrN7dgS7tmoJg7Yp+rJmMcG1BMPu2YExk6F3GESeNN8ND60djN3D1KrtbUuXfd6Wp446thWhC2d+37Kp0qZzQ1Oa7SmlKoxSaW7OXU2KtvNus8BGc+jSeeZGNPNFuLaEVq5HQnus+LJm25Ex86FjCW3XUrvGyqc6XR6IKUeeuB3+Aq984YUzX52GTcmy5vrUEtpTx619Pa52rxidLjMZJpmoi5QaPK57ajbCUX9vOgJCirozFKoRZxeYEnWwiSV4oG3THlgw0bdOYvFary9BAUouD1M/XgrQ0jeGqobteJf7puzqVtOd81B0enobd5tdozcQNYVNDGdn6oI91GbuVu8WG4PSxOnh3Otmlt3TNuNZtvVWgWHHO4Z71gbywsQ0raHlDHpWm43Rykb4YMeQn8+QUpNMsy9YDrPHncHQ6wXUiNTCmgX9qbjrWF27ZkW67ppqXZ+1JLtbT8YdeWRQnye2PB1PM94SfX2atCTdto2588DrllWzlGxvJK0D6tGNrg5qY3sAocj2xNENY+bH0ygQkRToRjxfY1GTHKMp6g4V4CpgRBEa7ZXOu1FaH/JZHVqqYPTSnRv5ArZ0dyipQ8uGlt9uQu/g7v3In7lWVLeE+cilWs21A216GIz1RF0hZ7DDK6s2X0HFiKZDI9EL03iQcE+v45W60WeQd6PBWqeRMJ1pzXZ4ysnQqit9RVctCgcwop2pDdVTLueH7ytFb2yYT2THSJ4gWikYWobJsqxmWVqQvJIW3jqkfiXNl2dOZwyHCnw2jNHzUHGN5xbUn1CePKJt8VgQnBNWxChBS5I/rguOoIJxwmNTku7rotC8bzabZ6pHLyfbY1PK3asWIfQs37Bkow37E7M/1p+1lt7qnutZS+/8eWXF2itwHmZl+86dWTicxjFKfC6aujRtXvS7hqloR7/oLU15nkBF7c+ezp7hLq7itmkenRvtK3d2+vCpShiunh3HXTx5ka60oWIarwdT9M5k3NfNZwuOngLGsuKxWn17ssrrySooRoc0QduivKDqdYPxNZVfLFRYGtOv9x3/iNJV+B/nD0RpuiX+s5/GKEwK8AT+AW4ZQfE1HG7/DdwGa69SXuP79ZNvvtwCFw0YgSdw+3WrMeJwzioZKRuqs3UngX/Yvn+aHe88HadJyHL8dVd+C7RyG5yGtHWOSsyBRZqDfoyWBMilGpKDMAEtx6i8cnVSXDyCCwbio47jPR9/Vf0Ur8uB8yjutFYJWExvXgW0A4IjQDYk3wOJBwXBaeIXACU+oOkSsBQU+4Kmy4vKgjDgIxKnCZD4q7WS+ET5WXardDlAGJOiAJsQlcMlYOskIfQomBDAAgLiy8mLlJJrPeWxfJClOQPigyCWRp13y791QQDy/bwUTlOMaJAW7GofnbT7cZg8HlV8NswmebjYAxYgBrbku5yAJGWAIBYmy5LvZBaJ03wP0uT4FSYFQwl+ta/dU9rDc9yDuzLwX1WHiwvvuijv7idwX//XK8PKW60DvMeUFFfLLCAJIDuCQXVd5NXjkapemFSz9JDmXsqeESX51SmUpFjnJxfmacqObwrFvmAkBmGRfMfAYk3pW3vV/kg523xkmbTMHqheW15kCJNXwx/4Lw1nYfzG7m3IgjABwj/jSCc0nrERLsCWAIwSkBOEA4D9pPJ5cPocA/rYVL6PA7T3SfLDI3AI2IaUAkS3aF+AJWEAgRovgYDkBHgEoxI56QJgGpKEAUxyVrx1U3mdIA8IfcZ+Apy+2QOtTgcqhvHOiGvPLVBIyTVAszBZ/gln/KrIMhZqNel6KU9ZilN6SgJXGwVDbF3muRovvbsuUBQUpMe6VoCPoN0qJ7e+2m+3TKWEyDlj5UERVzGqns7LrUlWJjbw6U8d6jUX/ubhv0yO/3Ik9VARvF66QRIfHHmKEi8XMZW3+fS7ApBkE+ZpUmZBsEF5iDxKCoByAi7JkfhHaDy+sv7hdPqtott9ONY1RTcvYJ5aiqW8qdAva7Im78rxddtRDctUz3mnVM9djsSdu4izXE0xjFZXebr9n//6z/8Gd9pY75vP5SRtHuPzvGAo0O63lTJ7nVeOmEbs8tlpmcrloQMqhjUyn+6+R9sCFC8FKEjiczEpjlmA446Gc+ucgrvXUwHuQsB5qb8Ht3dnw25/OEslOEjB3Un2zU2+TnDsn943cBCnPviw+x2YOZHy9zz/vohy4JTrMKOAJOWtAo5L0u2pnPzKm+wfeV3dcUVAKD11gb/0vHqFzrJqcWSdgizMSBm9N0W6zjH5+mPOzbegS9ib8gL6ncpNXzfMlt5Wnvudp7vvcel4blQcYflYrQqNZkWs1yrnf6sUMVKwakwY4nzEUPUiiwv9H0odraIgcemfskAmKCaVG9UajV671afbu49fb2A/cXcfr4z5dFuKm+RhwkC6PhmekO2V3OOd3xqEHSvpuRhdtss4vfv4RvWnylGkcfbCO4bKzeVXeckFYdyrqLs3Yv4at312zmmo8EoHvd46SwHs6SdnQLIMC0byt7g4pu2S5uZd0Bxj9k3vX5Y87rTEbRBdE/DvZbxwJPGzNEzYKZI//tpU8enMcpYS+iX9b8xYn8DPYPUCuBzcVowjn8HyMFnegp9ODrkep57Ptj6fx6nKqkiTmwv7r1He/k5h4GdwvKQ8Btzi9xpw87WR7/wfN4Dj0JqlfyWsdUhG0z0o5+VjcTiNNsUJZ+fNEmWX8QW0W8d2KFyEGDFSufFQQRo1wPmAAz/++CO4+/juufcT+AncfbyeZD9dzUC/pCYi++OE8UbX/xeuv/I28ZtQPjny+BDxFrmfN26/TnmC5atTv/TeiYGLyP7owXeCcc7+j4IvV3MVF1+c5i8E8UutWWdndIOC5JsQkzPKJznJymbv/aT+XQFyEqeMvGc7ArNIcUTKqeAXeoyLtJOI87PO3688XlamT48P9zz/hTM57pub/w0AAP//cfzl73weAAA="
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 5 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ latest_version          = 5 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs9wV5QFLEsLnFfTwt9EJKim+eojcbvbNRTTfBb4qsRXhceqIFxI3IkxUowX0xy/jBTPfGkb+jPM6RPcFU8FRjlmRQIpXOH8aVNwGBaME55akvTQEIXWQ6vVulA9+TnenVpV7kG1MSYX+aYtmx1jMLUGE/1Fa+vt3qXKtfXuP66s2PgFyqOsbOq5CwuH0iSBNODimUfS1lW/Z1qKdkJLb2vKy9RQ1MH8uWBwFdEVF1GGcwoJt0vz+NJ+3+DWHRjPNcxQ7YItdwX7Kl3pGIplvh1M0bvTyUC3Xmxj/BwylhVPtdo2Q5jjA0ESGnWJbzbqLV9AAdc67vOHY2NbfX/y6tvJqyVjFSbwmNLLRddue5Pv2fXNQpWlCfl+y/LnOF1H/3H5gISkOxy8BGkCI1qAZ/BncMcwTG7d6u7fwF248avlXX9cPwP47Ra4akAQPIO771uNIIdyVs1w2YtdrDsL/Lvt+6fZ8QHpJKURy9H3ofwRaOU2OM93mxyWjgmWaQ4GCVxhIJdqcA4iCtquWX3j6qaoeAJXR0lOOk73fPpVC1K0KWfVk7jzWjVkCam8CeiEGMUAb3F+ABIPCoxSGhQA0gCQdAVYCopDQdLVVWWBGQggTlIKJP5mrSQ+U36V3S4hBxAhXBRgG8FyLgVsQykmJ8EYAxZikFxPXqQE3+opjxWALM0ZEB8FsTTqslv+bQoMYBDkpXCSIkjCtGA3+/CsPUgi+nRS8dUwB+fR8gBYCBnY4Z9yDGjKAIYsoquS72wWTtL8AFJ6+opowSBFb/Z1+kpndEkO4L7MDm+qo+WVd1OUd/czeGj8641h5a02ADoggoubZRZiCvAeI1DbFHntdKSaH9Falh7T3E/ZCyQ4vzmFQotNfoYwT1N2eo4oDgXDCYgK+hMDyw0h7+1VB2PlYvOJZdq2+qB2a3mRQYTfDH/kvzWcRck7u3cRCyMKhH/Gkc7eePGNaAl2GCBIQY4hCgEKaPXrzPU1BvSJpfwuCeEhwPT3T8DFYBcRAiDZwUMBVpgBCOq8BEKcY+BjBEvPSZcAkQhTBhDOWfEepvI6QR5i8oICCtyB1QeXAvjBiFvkljAi+NZBs4iu/gEwflVkGQv1unS7lKcsRSk5J4GbjYJBtinzXJ2XPlwXKAoC0lPxK8Bn0GmXQ99AHXTallK6yCVj5WGR1BCsnc/LbXBWJjbw5R861Fsu/KuH/zY5/suJ1IdF+HbpJqYBOPEUpb9cxVTf59OfCoDpNspTWmZBsIV5BH2CCwBzDK7JEQcn13h6Y/270+mPiu4MjImuKbp1deaZrdjKuzL+usGbj+X4tjepRWWq5/xzqueuR+IurcZFrqaYZrunPN/9z3/953+De22iD6yXcgi3TvF5WTAVwxl0lDJ7XVZOPg3Z9bPbtpTrG4mhmPbYer7/HdwVoHgtQIFpwCW4OGUBjjsZzm1yAu7fTgW4KwHnp8EB3N1fDLv7/UUqRmEK7s+yK5V8Q1ESnJ9GUJikAfi0/xt85kzKP/D8xyLKgXOuQ4wATMtbBRxH0925nPzKc+7f8zC754oQE3JuFX/pZfbGO8uqxeFNCrIow2X0Vop0kyP8/Xegyo+gh9m78gIG3WploJtWW+8oL4Pu8/3vUAk8Ny5ObvlUqwnNVlVs1KuXf2sEMlywWoIZ5ALIYO0qi4uC35c62kWBkxKfskBSmOBqRbXH47eW9vnu/vP3u9wv3P3nG2O+3JXipnlEGUg3Z8Mp3t3IPd35nYnZqZJeitF1u4zT+8/vVH+pnkSaFxQ+MFQr11/lJReYcW+i7t+J+W3c9gWc8+ThlwC93TpLgdHXz2AYeBUVDOfv/eKUtkuayoegOcXsuwGgLHnceYnbQrLB4N/LeOEwDbI0ouwcyZ9/bfT4cmG5SImCkv6vDGJfwF/A+hVwObirmic+k+URXd2Bn8+A3M5cLxdbXy4zV3VdpLRyZf81yru/URj4CzhdUp4Abvm3GlD53lx4+T8fwHFww9Lfkq91cUbSAyiH6lNxOI82xdnPLpull13HF9Bpn9qhaBkhyHC14sMCN+uACwAH/vjHP4L7zx9eir+An8H959tx98vNDPRLamJ8OE0Y73T9f/n1dx4w/qorn4E8vVa899yvG3ffpzy75Ruo36J3ZuBifDgh+EEwytn/UfD1am7i4pvT/PZc/NQclNXhO45eVpdNdkNS+RFYk+7k/cxAMQ7KPIxSusV5WY+iU2fZ1U1Qltgc7Mped4cBgRuKwmoFQXYKirsbpC9jwpdb9Msq9eUO/PzzrQm/IYiv5XyTXXAFBc63EcIXfKc5zsp++uNjyE8FyHGSMvyR7RT7RYpiXA5ev9DGXaWdRVye1/70Edanxwee/wZMjvuh8r8BAAD//wU1W8oaIAAA" -> "H4sIAAAAAAAA/9RZ2XLjOHe+V9W8A+JxamaqQ4mLFsv/eOoXJVIrKXEX9SflAkFIpAguJqG1p18kN7nN4+URUtTilt09a/6q1PimReAsHw4+nIOD7qYJxQllzEOGH0G8ITTMYE5rcbjH/t+Al24SH+aHpztlqEji1FJ7Hd29q5RfjI3zIkyTR8BV2W8q31QY5lbom8rVdi8ssrQI6UkWUgpREOOE/g0sQ4ITGOOnuzAJaRUtV3eftcwcJsUS54yUoNQPk9UjaHkhvRE4QaZ4T2uIpBufQWmyDFffVJQwxl+A+/ZWplLZFDgvHisAMKBE8Agw4plysAIAAEURPMMNDdI8PGL/OcKHk2z5x4C7ogiYvICg0+l0REE9wi53QLxUfvY6WkfsdDrdjtbdr5fycEj6y27SDhEZHGInl8TctHgyadLI6Jsczlp+d3bccWu36SSBRmZzJcOzPFT36pz0H5Azbdd0ORN99tiWd+rhQ7RcBe3l5qC69fbwgwKb04Npi6tGoKbyfqnP+41wQFHN0EjiSXI4zoyoTsIsrWsLKtJ41XlZRUan2TsGh5XX3DSUdrg3h/u6I643hsL259pRXWd4eQidzYdiqH8IeCvXonFH3GyGrubla/JBDuwYTrb59mBO+U0xpdvEFdeBN9sdpi3ema1hNvZr7cCELzOJ28mHpiXzyRzVZ6sduwo1r1mEnmweW6qJ947Q0NoPL5k2dRR3jLLVIicGHAzGC0MJ6HHaUvxFPp3I1jw1uA7uHOqrgCI1n4om8RrGdtYSjkf2RdRlHnWn9Sm7yxq73css2O74hHpCZk5m1Md09MFusNosyZL5wTCSRcYf5R3CPOfN981WErRJEkzyxWqNWyjVkllH3tcQEZqSMTqsws0MibsPEffgboirzK0XKNJoN5pE+rqXrc05jxvKiGumvVYxGqB6zWlEh+Vk6yuFHfgvXHc+6Nv2NDumK49tN2w3ZPW5nCULvcZhe9Wt6R8c+0DdpfvA5kt7ivxOyvcXy2TUOLq6NR+N2soigsl+L0gtaxpG0khtF9aaZ9ljs3s4sMPl8MX0RpzYWLaWvgCRnk/qPeRavjysceJBdZoyt26hRdjpT0dj1TvOZdYU6PJhz2JOe3oCMVyn+d9z7AeQVlEa373lO/b5RoNrnzjfPXOeLHpDTjWlRjk2nIncWib1rCmbYrgfmM3dNGrOH5J1bdHC6UzVpJrC7sb1h8YYpN7Gh+EbZ5VdHlL8XGaEy7HMIA0eQY3G2fl4P5c54nkL8+KEDJ2zwCP4+QJ0aojWcNJ77k4VZWg+PQgILh9YFjf4Bl/36lx92Vo2vGUDYtYXUJvj0UOba/MX7e5UmU0NSb+qt5YNLDR9v11/4BrsEqK6xwpNoYmavtD2vFYT8/iB85fvnXeeu5JuPk0Mlk4Mrqtb/sgMxZ5ujyzDWow0Vrb00xxLuxE3MixdsiW1pzmL+YKVBcMaiQuW2FZP1RTePaq22LeiBufxCxbHSsPsRbzeDyyP10Wf1XXHyiYel43gYLE2I1nXrd1YI7Los4sX3bZVLSIDzZRt3ZIFn92HCtvIFrJfIC7rqfPF2nNUwegHazPiXrS5P7Mlu2na+gJbnGSb6hz21ak5z0R/l5Vz9TdzkTw37ZHus3biWLpj2bKkSzLrx8rBWMuBLQS52Wcb2M6aGquKFksEXZYXRkS3TkRSP1an3RPmUdeyZGnB+7IlydJJ1mn3ym8tklUtEXPHll3DVhX3GEwcJ1MtmyQ4EfWppYoKN5oosT/Ue+LenctHf70au/ZobUcKrxKlsYiCvW5Ze2jtbUd6EJTeSMdr+wj5LFWEbG8OyMBaB4JF3O2EV0eKM9yjtWhjOzNddg8VDgm2nR20XcqqPT12hfRozkndk9WmzdkLixMTLSIT2PfF6UCmiGSG4rRj19EPeGAbZpcevWghGQ6tKwLK3aM8Xtj2RonVQpH9rEts1umNBjq36OnEV01e3i4iPXdku6cn9sQY+GPL8fvmQD8akgodR4194juGnEE1qtd91t8pRIaOOWy4x4Dz5uKLYnfGlrQoHEmpL/oyNCUucGQS6qaoGnPdUSR1aCSioLNk5yZk49nE8rr0qCc27/X0rd3nDniQbvE8aCJJ5+2Im6FIHnlaVvf4QkDEpvbAjvS+LVvcqGvyvqhYlHMtzrAHdmDMRd07jiJPWOzHx85ej92jZtUPtqWKPmuLmiNPbYnr63N/aNlE6pKFoUjtrkaIrEepsDAXriJEu0W/XSCjPXbJInMjkvm8vrG4Tq5GXHcq+aJi25Ex93XH4rquJfeNtU9UsjpiU4w8fjf+BV3xqqvPfVkL24JlLVTN4rqa49a/fq72rxzVVpmoJxmv8oQYLGp4cjZB0fBgOhyEkrw3JKJgZx+YAnGQiQT9SLqmPbL0RN05icUqg6Ggc7rgsnrqxytOt9StIcthN97nvim6qtV2F6zOOwO1i/rtvjEY8YpEZ4azN1XOHitzd6f2i61BSOIMUO71M8seKNvpPNt568Cw4z1FA2urs9zMNK2x5YwGVpdO4dqG6GjHOruYQ6kumOaQsxxqT3ujsTcIiBHJhTUPhhq/71l9u25FquqackOddwS730imPXFiEJ/FtqhNtYy1eF/Vko6g2raxcB5Y1bLqlpQdjKRzhAOyVeVRfWqPdJ2nB+yohjH3Yy0KeCgEqhEvNohXBMdo86pDOH0dUCxxze5aZd0obYzZrKFbMmcM0r0b+RyyVHcsyGPL1i2/29a9o3vwI3/uWlHD4hYTlyh11w4U7Tiaqom8hs5oj9ZWfbHWJSPSxkaiFqbxIKCB2kBreavOddaNRhuVRJw2V9rd8JyTdashDSVVtog+0iPS02xdPudydvy+UgymhvkUJhTnCSTVgsJVmKzKapalBc6raeFtQuJX03x10XSm+ljSnw1j8jyWXOO5o6tPME8e4a54LDDKMS1imMAVzh83BYNhQRnusS0IrQbPtVvtdvsi9ejleHe6lDIt2cKYXOwblmh09eHMHE7VZ6WjdvqXetZRe3/eWbHxCpSHWXl9Zy4qDErjGCY+E2kuSdtX/65hSsopLmpHkZ5nuiQP50+XyDDXUDG7NI8uF+2bcPaG+lMNU1S7BI65RvJqXerqkmm8LkxSe7PpUDWfLX3yFFCaFY+12jZDmGF9TuAadYFtNuptj0M+0z7u89axsa2+XXn1deXVUrEKY3hME7gryl2s3d5Cvobri4EqTWPy9cvJP6J0Hf7H5QMSku6w/+ynMQyTAjyBf4A7imF8y5m7fwN3wcarlnv9fvwcwC+nwNUDguAJ3H0dNYIMymk1w+Wt64LubPAP4/un4XgX6ThNQpqjr4fyW6CU0+DcyW1yWBITLNMcDGO4wkAs3eAchAnoOEb1VauXouIRXIkSn3yc9vn0q+anaFN2pSdz57FqQGNSeTXQDTCKAN7i/AAEFhQYpYlfAJj4gKQrQFNQHAqSrq4uC0yBD3GcJkBgb8ZK4bPkZ9udMuQAIoSLAmxDWHaggG6SBJOTYYwBDTCIrysvUoJv/ZTL8kGW5hTwDxxfgrrMln+bAgPo+3lpnKQIkiAt6M08PHv34zB5PLn4DMzGebg8ABpACnb4uxyDJKUAQxomq1LvDAvHaX4AaXL6CpOCwgS94usOpO74khzAfZkdXl2Hy6vupij37ifQavzrDbByVxsAHRDBxc0wDXAC8B4jUNsUee20pJoXJrUsPaa5l9JnSHB+swopKTb5OYR5mtLTw0NxKCiOQVgk31Gw3BDyFq88nEgXzCeVWcccgNot8iKDCL8Cf2C/BE7D+A3uXUiDMAHcP2NJZzZeuBEuwQ4DBBOQY4gCgPyk+rm7+nwG1KkpfR8H8ODj5IdH4GCwCwkBkOzgoQArTAEEdVYAAc4x8DCCJXPSJUAkxAkFCOe0eBumcjtBHmDyjPwEOENzADq9ni4ZxjsQt5FbwpDgW4JmYbL6E8H4VZPlWajXhduhPKUpSsk5CdxMFBTSTZnn6qzwbrtAURCQnopfAT6Cbqds74bysNsxpZIil4yVB0VcQ7B2Xi+zwVmZ2MCnP7Wo11z4m4v/Mjn+y0nUg0XwuukGTnxw0ilKvlzNVN/m0+8KgJNtmKdJmQXBFuYh9AguAMwxuCZH7J+o8fiq+ofT6beSag/1qapIqnkls2ZJlvSmjL9s8OZ9Ob69m9TCMtUz3jnVM9clMZerxsWuIhlGpy893f3Pf/3nf4N7ZaoOzeey3TZP5/MyYEi6PexKZfa6jJw4Den1s9cxpetriC4Z1sR8uv8e7gpQvBSgwInPxLg4ZQGGOQFnNjkB96+rAsxVgPFS/wDu7i/A7n64WMUoSMH92Xalkm8SFPvnRxAUxKkPPux/B2fOomyLZd8XUQaccx2iBOCk3FXAMEm6O5eTX3m4/SNPsHumCDAh56viL73B3rCzrFoM3qQgCzNcnt5KkW5yhL/+4lP5FvQxfVNewLBXrQxVw+yoXel52Hu6/x6VgWcmxYmWj7Ua12xX+Ua9evm3RiDFBa3FmELGhxTWrraY0P+h9NEpChyX8SkLZAJjXK3I1mTyeqV9urv/+PVb7ifm/uMNmE93pblZHiYUpJsz8ATvbuye9vzOwPRUSS/F6DpdntP7j29cf6qeTBqXKLxTqFauv8pNLjBlXk3dvzHz19jtS3DOnYdXBuh112kK9IF6DoaOV2FBcf6WF6e0XcpU3h2a05l90wCUJY85DzFbSDYY/Ht5Xhic+FkaJvR8kj/+Wuvx6aJysRL6pfxvNGKfwM9g/QKYHNxVjZOeQfMwWd2Bn84Bue25ni9Yny89V3VdpEnlqv5rkne/0xj4GZw2KY8Bs/y9ACpf6wsv/7sDGAZuaPpX4loPZyQ9gLKpPhWHc2tTnHl2mSxZdm1fQLdzug6FyxBBiqsVDxa4WQeMDxjw448/gvuP796EP4GfwP3H23b3000P9EtuInw4dRhvfP1/8forDxi/SeVzIE+vFW+Z+3ni7uuSZ1q+BvXL6J0VmAgfThF8Zxjl9P9o+Lo1N+fii9X8hSh+rTWb7MJuUOB8GyJ8Yfksx1l52XvfqX9XgBzHKcXv1U7ELFIU4bIr+IU7xtXa2cTl7efvNxEvK9Onx4cWy34RTIb5pvK/AQAA//8uvynmoR4AAA=="
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210128215229758600000002" -> (known after apply)
      ~ id                                  = "sfr-35f3a1ad-d794-4ac3-92cc-989e34064519" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "5" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210128215210203900000001" -> (known after apply)
      ~ id                                  = "sfr-7bbb285d-e996-40ac-a242-794b5cd6792f" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "5" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*